In [1]:
import pandas as pd
import pymysql as sql

In [5]:
conn=sql.connect(user="root",password="engineer",database="college",host="localhost")

In [9]:
df=pd.read_sql("show tables;",conn)

In [10]:
df

  Tables_in_college
0         customers
1        customers1
2          employee
3              exam
4        first_year
5            orders

In [12]:
df=pd.read_sql("select* from customers;",conn)
df

   id       name              emailid
0   1      shani      shani@gmail.com
1   2    pradeep    pradeep@gmail.com
2   3      pooja      pooja@gmail.com
3   4       amit       amit@gmail.com
4   5      kajal      kajal@gmail.com
5   6      rahul      rahul@gmail.com
6   7     deelip     deelip@gmail.com
7   8  priyanshu  priyanshu@gmail.com
8   9       ajay       ajay@gmail.com

In [13]:
df[df["name"]=="shani"]

   id   name          emailid
0   1  shani  shani@gmail.com

In [24]:
df[df["name"]=="shani"].name

0    shani
Name: name, dtype: object